% Ορίζουμε τις άγνωστες μεταβλητές:
% Y: Η σύνθετη αγωγιμότητα (Admittance) της αντιστάθμισης που ψάχνουμε
% Is: Το ρεύμα στην είσοδο (αρχή της γραμμής)
% phi: Η γωνία φάσης της τάσης εισόδου (αν χρειάζεται να βρεθεί)
syms Y Ig phi;
% (Σειριακή σύνθετη αντίσταση Z = R + jX)
Tse=[1, 0.1+1.0996*i; 0, 1]; %Tse: Πίνακας για την ισοδύναμη αντίδραση της γεννήτριας
Ttr=[2/15, 0; 0, 7.5]; %Ttr: Πίνακας για τον ιδανικό μετασχηματιστή ανύψωσης
Tpar=[0.9571+0.0127i, 22.8670+78.1027i; 0.0011i, 0.9571+0.0127i]; %τετράπολο παράλληλων γραμμωών μεταφοράς
T_pre = Tse*Ttr*Tpar; %T_pre: Ο συνολικός πίνακας ΠΡΙΝ την αντιστάθμιση
Tcom = [1 0; Y 1];      % Μοντέλο παράλληλου πηνίου-αντιστάθμιση
Tfin = T_pre * Tcom;  %ολικό τετράπολο κυκλώματος
% Vs: Τάση στην αρχή (Sending End - Γεννήτρια)
% Μετατροπή από Line-to-Line σε Phase voltage ( / sqrt(3) ) και κορυφή ( * sqrt(2) )
% Το exp(1i*phi) προσθέτει την άγνωστη γωνία φάσης
Vg=((20000)/sqrt(3))*exp(1i*phi);
% In: Διάνυσμα Εισόδου [Τάση_Εισόδου; Ρεύμα_Εισόδου]
In  = [Vg; Ig];     % V1, I1 (είσοδος)
Out = [((150000)/sqrt(3)); 0];   % V2, I2 (ανοιχτοκύκλωμα)
calc = In == Tfin * Out; %Input = Matrix * Output
solution = solve(calc, [Y, Ig, phi]); %υπολογισμός σύνθετης αγωγιμότητας
%Yfinal = double(solution.Y)
%Yim= imag(solution.Y);
%Yin_screen = double(Yim)
%L=-1/(2*pi*50*Yim);
%Lfinal = double(L)
Z=1/solution.Y;   %μετατροπή συνθετης αγωγιμότητας σε σύνθετη αντίσταση
Zfinal=double(Z);
Zim=imag(Z);
Zimfinal=double(Zim);
L=Zim/(100*pi); %εύρεση αυτεπαγωγής από φανταστικό μέρος σύνθετης αντίστασης
Lfinal=double(L); %αυτεαπαγωγη σε Henry
disp('Η απαιτούμενη αυτεπαγωγή (L) σε Henry είναι:');
disp(Lfinal);