syms Vs phi Is A B C D Y Vr;
%Λύση με Symbolic algebra ώστε ναδουμε ποιες μεατβλητές χρειαάονται να
%αντικατασταθούν
%Αντί για το ολικό τετράπολο έχω το γνωστό κυκλωμα * Τ_αντιστάθμισης
precalc=[(Vs*exp(1i*phi)); Is] == [A, B; C, D]*[1, 0; Y, 1]*[Vr; 0]; 
%αντισκατάσταση τιμών 
A=0.1185 + 0.0025i;
B=3.6620 +18.3164i;
Vs=(20000)/sqrt(3);
Vr=(150000)/sqrt(3);
%επίλυση της εξίσωσης ώστε να βρεθεί το Υ
calc=[(Vs*exp(1i*phi)); Is] == [A, B; C, D]*[1, 0; Y, 1]*[Vr; 0];
solution=solve(calc, [Y, Is, phi]);
%εύρεση του L
Z=1/solution.Y;   %μετατροπή συνθετης αγωγιμότητας σε σύνθετη αντίσταση
Zfinal=double(Z);
Zim=imag(Z);
L=Zim/(100*pi); %εύρεση αυτεπαγωγής από φανταστικό μέρος σύνθετης αντίστασης
Lfinal=double(L); %αυτεαπαγωγη σε Henry
disp('Η απαιτούμενη αυτεπαγωγή (L) σε Henry είναι:');
disp(Lfinal);
